eu.alert-project.iccs.events.core/src/test/resources/SampleRecommendIdentityReply.xml

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <s:Header>Header</s:Header>
  <s:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:Topic>ALERT.Recommender.IdentityRecommendation</wsnt:Topic>
        <wsnt:ProducerReference>
          <wsa:Address>http://www.alert-project.eu/socrates</wsa:Address>
        </wsnt:ProducerReference>
        <wsnt:Message>
          <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sc="http://www.alert-project.eu/socrates" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
            <ns1:head>
              <ns1:sender>SOCRATES</ns1:sender>
              <ns1:timestamp>1331741062899</ns1:timestamp>
              <ns1:sequencenumber>1</ns1:sequencenumber>
            </ns1:head>
            <ns1:payload>
              <ns1:meta>
                <ns1:startTime>1331741062899</ns1:startTime>
                <ns1:endTime>1331741063600</ns1:endTime>
                <ns1:eventName>ALERT.Recommender.IdentityRecommendation</ns1:eventName>
                <ns1:eventId>5478</ns1:eventId>
                <ns1:eventType>Reply</ns1:eventType>
              </ns1:meta>
              <ns1:eventData>
                <sc:identities>
                  <sc:identity>
                    <sc:uuid>823f4955-8825-4957-944f-f48b9276a79d</sc:uuid>
                    <sc:name>No Name - 823f4955-8825-4957-944f-f48b9276a79d</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>0b2248d3-0590-4cf4-9f80-37602d7969ff</sc:uuid>
                    <sc:name>No Name - 0b2248d3-0590-4cf4-9f80-37602d7969ff</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>ab0ddecb-5584-4b99-bb60-ded14307ec88</sc:uuid>
                    <sc:name>No Name - ab0ddecb-5584-4b99-bb60-ded14307ec88</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>87783dfd-ba98-42f4-9835-a683901f04c2</sc:uuid>
                    <sc:name>No Name - 87783dfd-ba98-42f4-9835-a683901f04c2</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>7ba08630-9c55-497b-9a40-97c7bc0d902d</sc:uuid>
                    <sc:name>No Name - 7ba08630-9c55-497b-9a40-97c7bc0d902d</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>31338ce3-23cd-4e70-8771-54a6aaf01d36</sc:uuid>
                    <sc:name>No Name - 31338ce3-23cd-4e70-8771-54a6aaf01d36</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>01890926-739a-4c44-ba87-11a6518f02a0</sc:uuid>
                    <sc:name>No Name - 01890926-739a-4c44-ba87-11a6518f02a0</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>8a140f62-31a0-4cf5-8b76-b51b0d8a4f99</sc:uuid>
                    <sc:name>No Name - 8a140f62-31a0-4cf5-8b76-b51b0d8a4f99</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>75d48f1d-8ee3-40ba-ad00-dc7e62504036</sc:uuid>
                    <sc:name>No Name - 75d48f1d-8ee3-40ba-ad00-dc7e62504036</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>344058ef-23a8-4f99-a09b-081fbb199c09</sc:uuid>
                    <sc:name>No Name - 344058ef-23a8-4f99-a09b-081fbb199c09</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>8473a8cb-dcbe-4f83-bdce-a8b95b0964aa</sc:uuid>
                    <sc:name>No Name - 8473a8cb-dcbe-4f83-bdce-a8b95b0964aa</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>1e3fd8a6-3dd6-4cf3-999f-3fa1eb45e88c</sc:uuid>
                    <sc:name>No Name - 1e3fd8a6-3dd6-4cf3-999f-3fa1eb45e88c</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>e8be306a-dbdd-4a76-87dc-e962a979d61b</sc:uuid>
                    <sc:name>No Name - e8be306a-dbdd-4a76-87dc-e962a979d61b</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>b09a986c-aad4-4321-bb03-2b910abe1e69</sc:uuid>
                    <sc:name>No Name - b09a986c-aad4-4321-bb03-2b910abe1e69</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>8e95be3e-50ff-4bcb-a023-48129c8fe4a9</sc:uuid>
                    <sc:name>No Name - 8e95be3e-50ff-4bcb-a023-48129c8fe4a9</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>3c890ee5-f445-416c-8d84-504daa8ccad3</sc:uuid>
                    <sc:name>No Name - 3c890ee5-f445-416c-8d84-504daa8ccad3</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>9266c2c4-3086-4db6-ae74-0773f3535b7e</sc:uuid>
                    <sc:name>No Name - 9266c2c4-3086-4db6-ae74-0773f3535b7e</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>d9e54341-3c7d-4276-b6ef-d92e838acaad</sc:uuid>
                    <sc:name>No Name - d9e54341-3c7d-4276-b6ef-d92e838acaad</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>06739bae-1e37-4386-a096-c477b29e29a9</sc:uuid>
                    <sc:name>No Name - 06739bae-1e37-4386-a096-c477b29e29a9</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>6c3cca6b-a837-4f29-906d-872ab42de5f6</sc:uuid>
                    <sc:name>No Name - 6c3cca6b-a837-4f29-906d-872ab42de5f6</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>23c5e1cf-d32d-487f-a316-f57e5fe4f166</sc:uuid>
                    <sc:name>No Name - 23c5e1cf-d32d-487f-a316-f57e5fe4f166</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>eb90d3aa-cac2-40df-a473-9af97a19243a</sc:uuid>
                    <sc:name>No Name - eb90d3aa-cac2-40df-a473-9af97a19243a</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>dfc2ef58-8633-4dcf-9145-dd8e41053cad</sc:uuid>
                    <sc:name>No Name - dfc2ef58-8633-4dcf-9145-dd8e41053cad</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>638379ac-7710-449a-b99c-fdd378f71aca</sc:uuid>
                    <sc:name>No Name - 638379ac-7710-449a-b99c-fdd378f71aca</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>7a0d3cf6-d556-42a8-8350-b4ef9e171696</sc:uuid>
                    <sc:name>No Name - 7a0d3cf6-d556-42a8-8350-b4ef9e171696</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>3de7a8b8-79f8-4dce-8ad3-343fe2426fa6</sc:uuid>
                    <sc:name>No Name - 3de7a8b8-79f8-4dce-8ad3-343fe2426fa6</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>982603a4-2192-44b1-8421-0a0a325b3d28</sc:uuid>
                    <sc:name>No Name - 982603a4-2192-44b1-8421-0a0a325b3d28</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>f27c727b-e9fc-4643-bf72-1a7f7384397d</sc:uuid>
                    <sc:name>No Name - f27c727b-e9fc-4643-bf72-1a7f7384397d</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>31193035-c9b7-4d15-b423-bf76277b6266</sc:uuid>
                    <sc:name>No Name - 31193035-c9b7-4d15-b423-bf76277b6266</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>7f9d2d58-7fe6-442a-be94-f30a382cf332</sc:uuid>
                    <sc:name>No Name - 7f9d2d58-7fe6-442a-be94-f30a382cf332</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>58d1a562-4320-412a-898b-bdef8dac9fbe</sc:uuid>
                    <sc:name>No Name - 58d1a562-4320-412a-898b-bdef8dac9fbe</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>85aedaf1-42d3-4bdb-9748-15156e8f071c</sc:uuid>
                    <sc:name>No Name - 85aedaf1-42d3-4bdb-9748-15156e8f071c</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>f07bc8bb-3f11-4b26-9293-2da7366bea9f</sc:uuid>
                    <sc:name>No Name - f07bc8bb-3f11-4b26-9293-2da7366bea9f</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>3effb83a-73fe-4da3-9612-450f78c2b2c3</sc:uuid>
                    <sc:name>No Name - 3effb83a-73fe-4da3-9612-450f78c2b2c3</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>1d08615f-73e1-4a83-bc2e-d75b61f93baa</sc:uuid>
                    <sc:name>No Name - 1d08615f-73e1-4a83-bc2e-d75b61f93baa</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>f13d10a9-f306-4aa1-934a-6f37376a52d2</sc:uuid>
                    <sc:name>No Name - f13d10a9-f306-4aa1-934a-6f37376a52d2</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>03a42b0a-4128-4189-9c92-33759b7c428d</sc:uuid>
                    <sc:name>No Name - 03a42b0a-4128-4189-9c92-33759b7c428d</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>fc70f358-2112-4e09-a5e5-dcc59d880cfa</sc:uuid>
                    <sc:name>No Name - fc70f358-2112-4e09-a5e5-dcc59d880cfa</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>3306ca0e-57b0-44b4-b9ad-bcb0f276f106</sc:uuid>
                    <sc:name>No Name - 3306ca0e-57b0-44b4-b9ad-bcb0f276f106</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>82f09a33-4ed9-4c9a-9fea-78e1ae9b8563</sc:uuid>
                    <sc:name>No Name - 82f09a33-4ed9-4c9a-9fea-78e1ae9b8563</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>1299fd43-5af0-4fc2-ba53-864f2d7adbe3</sc:uuid>
                    <sc:name>No Name - 1299fd43-5af0-4fc2-ba53-864f2d7adbe3</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>e87e9304-ecf6-4c35-9e36-fb3d62cc990e</sc:uuid>
                    <sc:name>No Name - e87e9304-ecf6-4c35-9e36-fb3d62cc990e</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>ee2e2c05-338d-47f0-99a5-709dd49eca09</sc:uuid>
                    <sc:name>No Name - ee2e2c05-338d-47f0-99a5-709dd49eca09</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>7a30a972-b7c7-43c3-b09d-9ddb80fd36b9</sc:uuid>
                    <sc:name>No Name - 7a30a972-b7c7-43c3-b09d-9ddb80fd36b9</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>32467f09-a009-42f5-8447-099fef9f4f26</sc:uuid>
                    <sc:name>No Name - 32467f09-a009-42f5-8447-099fef9f4f26</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>1c412500-41ac-4347-92bc-36b907f50795</sc:uuid>
                    <sc:name>No Name - 1c412500-41ac-4347-92bc-36b907f50795</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>04fa25c8-97cf-4103-9fd3-8f646c7a7e09</sc:uuid>
                    <sc:name>No Name - 04fa25c8-97cf-4103-9fd3-8f646c7a7e09</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>327fb063-a96f-4aa3-b3ab-63d9e1ca3378</sc:uuid>
                    <sc:name>No Name - 327fb063-a96f-4aa3-b3ab-63d9e1ca3378</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>3818e71d-09f6-4199-bc00-eb646086e41e</sc:uuid>
                    <sc:name>No Name - 3818e71d-09f6-4199-bc00-eb646086e41e</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>9e3d2a64-ff8d-45a2-8034-55d7699caa08</sc:uuid>
                    <sc:name>No Name - 9e3d2a64-ff8d-45a2-8034-55d7699caa08</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>8501010b-392e-4837-a61e-6aae78903cf9</sc:uuid>
                    <sc:name>No Name - 8501010b-392e-4837-a61e-6aae78903cf9</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>f3ff4286-0fb2-4853-a324-e84e39e161e5</sc:uuid>
                    <sc:name>No Name - f3ff4286-0fb2-4853-a324-e84e39e161e5</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>5eaeab40-e9fd-4dbc-93b5-c1a46b9234c4</sc:uuid>
                    <sc:name>No Name - 5eaeab40-e9fd-4dbc-93b5-c1a46b9234c4</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>b3a9c172-920c-4f38-a1f9-21ae3fbe6ffb</sc:uuid>
                    <sc:name>No Name - b3a9c172-920c-4f38-a1f9-21ae3fbe6ffb</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>b1368652-dd44-42a8-89f3-c5d7dd74721b</sc:uuid>
                    <sc:name>No Name - b1368652-dd44-42a8-89f3-c5d7dd74721b</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>edac8115-dc4c-4587-81c2-bb1c1bf01fb7</sc:uuid>
                    <sc:name>No Name - edac8115-dc4c-4587-81c2-bb1c1bf01fb7</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>c2c4b856-ebbf-4043-8c3c-ee5341fb188a</sc:uuid>
                    <sc:name>No Name - c2c4b856-ebbf-4043-8c3c-ee5341fb188a</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>e5c7c20a-ebc1-4b9b-8aca-a84c2251c388</sc:uuid>
                    <sc:name>No Name - e5c7c20a-ebc1-4b9b-8aca-a84c2251c388</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>eb483694-9fd6-4867-8f34-01f975333625</sc:uuid>
                    <sc:name>No Name - eb483694-9fd6-4867-8f34-01f975333625</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>acf2692e-e580-43d2-b71e-5f52dfc4aadf</sc:uuid>
                    <sc:name>No Name - acf2692e-e580-43d2-b71e-5f52dfc4aadf</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>606ed508-0d99-41f8-9ac1-763d128c331f</sc:uuid>
                    <sc:name>No Name - 606ed508-0d99-41f8-9ac1-763d128c331f</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>73603004-74ad-4b87-98e5-ca64ab7ca6a5</sc:uuid>
                    <sc:name>No Name - 73603004-74ad-4b87-98e5-ca64ab7ca6a5</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>e0cd1642-b72d-4a63-bf0f-721f8ad2a712</sc:uuid>
                    <sc:name>No Name - e0cd1642-b72d-4a63-bf0f-721f8ad2a712</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>c9b9fc58-4707-4761-9aba-396db555e6df</sc:uuid>
                    <sc:name>No Name - c9b9fc58-4707-4761-9aba-396db555e6df</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>63f90989-54d5-47ab-b800-b139db6acd90</sc:uuid>
                    <sc:name>No Name - 63f90989-54d5-47ab-b800-b139db6acd90</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>f9feb295-e147-4e0b-bc28-c3858677f2b8</sc:uuid>
                    <sc:name>No Name - f9feb295-e147-4e0b-bc28-c3858677f2b8</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>69e513f5-7bbd-4923-b9f7-3ecbd7616eed</sc:uuid>
                    <sc:name>No Name - 69e513f5-7bbd-4923-b9f7-3ecbd7616eed</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>795ad50c-6784-41f6-9e52-5c3a323b4296</sc:uuid>
                    <sc:name>No Name - 795ad50c-6784-41f6-9e52-5c3a323b4296</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>2f68337d-b744-45f7-9631-df256cc8796c</sc:uuid>
                    <sc:name>No Name - 2f68337d-b744-45f7-9631-df256cc8796c</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>6378d2fc-1f35-410b-8eba-84a8699a3f4a</sc:uuid>
                    <sc:name>No Name - 6378d2fc-1f35-410b-8eba-84a8699a3f4a</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>a9a028dc-a21e-4007-986a-1f8c12151bdf</sc:uuid>
                    <sc:name>No Name - a9a028dc-a21e-4007-986a-1f8c12151bdf</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>6bdbffdc-896b-4906-a82b-26f6b0ecfa7e</sc:uuid>
                    <sc:name>No Name - 6bdbffdc-896b-4906-a82b-26f6b0ecfa7e</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>82e50ee0-b894-42ce-afb0-d9b44e54b763</sc:uuid>
                    <sc:name>No Name - 82e50ee0-b894-42ce-afb0-d9b44e54b763</sc:name>
                  </sc:identity>
                  <sc:identity>
                    <sc:uuid>414510fe-448f-4ace-a8cb-d76c10eecac3</sc:uuid>
                    <sc:name>No Name - 414510fe-448f-4ace-a8cb-d76c10eecac3</sc:name>
                  </sc:identity>
                </sc:identities>
              </ns1:eventData>
            </ns1:payload>
          </ns1:event>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </s:Body>
</s:Envelope>